In [1]:
import pandas as pd
import numpy as np

# import data
titanic_dataframe = pd.read_csv('data/titanic.csv')

In [2]:
titanic_dataframe.info()
# Есть пропуски в столбцах age, deck, embarked, embark_town

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [4]:
'''titanic_dataframe[titanic_dataframe['who'].isin(['man', 'woman'])].describe()
# Видим, что взрослым считается человек с 16 лет.'''

"titanic_dataframe[titanic_dataframe['who'].isin(['man', 'woman'])].describe()\n# Видим, что взрослым считается человек с 16 лет."

In [5]:
titanic_dataframe.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [6]:
print(int(len(titanic_dataframe[titanic_dataframe['adult_male']]) / len(titanic_dataframe) * 100), '%')

60 %

In [7]:
titanic_dataframe['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [8]:
titanic_dataframe.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [9]:
alive_titanic_dataframe = titanic_dataframe[titanic_dataframe['alive'] == 'yes']

In [12]:
alive_titanic_dataframe.describe()

       survived      pclass         age       sibsp       parch        fare
count     342.0  342.000000  290.000000  342.000000  342.000000  342.000000
mean        1.0    1.950292   28.343690    0.473684    0.464912   48.395408
std         0.0    0.863321   14.950952    0.708688    0.771712   66.596998
min         1.0    1.000000    0.420000    0.000000    0.000000    0.000000
25%         1.0    1.000000   19.000000    0.000000    0.000000   12.475000
50%         1.0    2.000000   28.000000    0.000000    0.000000   26.000000
75%         1.0    3.000000   36.000000    1.000000    1.000000   57.000000
max         1.0    3.000000   80.000000    4.000000    5.000000  512.329200

In [13]:
alive_titanic_dataframe.sex.value_counts()

female    233
male      109
Name: sex, dtype: int64

In [14]:
alive_titanic_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 342 entries, 1 to 889
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     342 non-null    int64
 1   pclass       342 non-null    int64
 2   sex          342 non-null    object
 3   age          290 non-null    float64
 4   sibsp        342 non-null    int64
 5   parch        342 non-null    int64
 6   fare         342 non-null    float64
 7   embarked     340 non-null    object
 8   class        342 non-null    object
 9   who          342 non-null    object
 10  adult_male   342 non-null    bool
 11  deck         136 non-null    object
 12  embark_town  340 non-null    object
 13  alive        342 non-null    object
 14  alone        342 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 38.1+ KB